; domain
(define (domain joint_bar)
(:requirements :strips :equality :typing :adl)

(:types link joint angle)

(:predicates
	(connected ?j - joint ?l - link) 
	(angle-before ?a - angle ?a1 - angle)
	(angle-joint ?a - angle ?j - joint)
	(ground ?l - link) 
)

(:action increase_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(connected ?joint ?link1)
	(connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(not (ground ?link1))
	(angle-joint ?a1 ?joint)
	(angle-before ?a1 ?a2)
	)
:effect (and 
	(not (angle-joint ?a1 ?joint)) 
	(angle-joint ?a2 ?joint)
	)
)

(:action decrease_angle
:parameters (?link1 ?link2 - link ?joint - joint ?a1 ?a2 - angle)
:precondition (and 
	(connected ?joint ?link1)
	(connected ?joint ?link2)
	(not (= ?link1 ?link2))
	(not (ground ?link1)) 
	(angle-joint ?a1 ?joint)
	(angle-before ?a2 ?a1)
	)
:effect (and 
	(not (angle-joint ?a1 ?joint)) 
	(angle-joint ?a2 ?joint)
	)
)
)

; problem
(define (problem joint_bar_3)
(:domain joint_bar)
(:objects
    link_ground link1 link2 link3 link4 - link
    joint_ground joint1 joint2 joint3 - joint
    angle0 angle90 angle180 angle270 - angle)
(:init
    (angle-before angle0 angle90)
    (angle-before angle90 angle180)
    (angle-before angle180 angle270)
    (angle-before angle270 angle0)

    (ground link_ground)

    (connected joint_ground link_ground)
    (connected joint_ground link1)
    (connected joint1 link1)
    (connected joint1 link2)
    (connected joint2 link2)
    (connected joint2 link3)
    (connected joint3 link3)
    (connected joint3 link4)

    (angle-joint angle270 joint_ground)
    (angle-joint angle90 joint1)
    (angle-joint angle90 joint2)
    (angle-joint angle0 joint3)
)
(:goal
(and
    (angle-joint angle180 joint_ground)
    (angle-joint angle180 joint1)
    (angle-joint angle0 joint2)
    (angle-joint angle180 joint3)
    )
)
)

; plan
1. (decrease_angle link1 link_ground joint_ground angle270 angle180)
   deleted: (angle-joint angle270 joint_ground)
   added: (angle-joint angle180 joint_ground)
   goals met: 1 of 4
2. (decrease_angle link2 link3 joint2 angle90 angle0)
   deleted: (angle-joint angle90 joint2)
   added: (angle-joint angle0 joint2)
   goals met: 2 of 4
3. (increase_angle link2 link1 joint1 angle90 angle180)
   deleted: (angle-joint angle90 joint1)
   added: (angle-joint angle180 joint1)
   goals met: 3 of 4
4. (increase_angle link4 link3 joint3 angle0 angle90)
   deleted: (angle-joint angle0 joint3)
   added: (angle-joint angle90 joint3)
   goals met: 3 of 4
5. (increase_angle link3 link4 joint3 angle90 angle180)
   deleted: (angle-joint angle90 joint3)
   added: (angle-joint angle180 joint3)
   goals met: 4 of 4
